rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
#include "ESP32_AI_Connect.h"
#include <WiFi.h>  

// Constructor
ESP32_AI_Connect::ESP32_AI_Connect(const char* platformIdentifier, const char* apiKey, const char* modelName) {
    // Set insecure client - consider making this configurable
    _wifiClient.setInsecure();
    
#ifdef ENABLE_STREAM_CHAT
    // Initialize FreeRTOS mutex for thread safety
    _streamMutex = xSemaphoreCreateMutex();
    if (_streamMutex == nullptr) {
        Serial.println("ERROR: Failed to create stream mutex");
    }
#endif
    
    begin(platformIdentifier, apiKey, modelName); // Call helper to initialize
}

// New constructor with custom endpoint
ESP32_AI_Connect::ESP32_AI_Connect(const char* platformIdentifier, const char* apiKey, const char* modelName, const char* endpointUrl) {
    // Set insecure client - consider making this configurable
    _wifiClient.setInsecure();
    
#ifdef ENABLE_STREAM_CHAT
    // Initialize FreeRTOS mutex for thread safety
    _streamMutex = xSemaphoreCreateMutex();
    if (_streamMutex == nullptr) {
        Serial.println("ERROR: Failed to create stream mutex");
    }
#endif
    
    begin(platformIdentifier, apiKey, modelName, endpointUrl); // Call helper to initialize
}

// Destructor
ESP32_AI_Connect::~ESP32_AI_Connect() {
    _cleanupHandler();
    
#ifdef ENABLE_TOOL_CALLS
    // Clean up tool calls array if allocated
    if (_tcToolsArray != nullptr) {
        delete[] _tcToolsArray;
        _tcToolsArray = nullptr;
        _tcToolsArraySize = 0;
    }
    
    // Reset tool calls conversation history
    tcChatReset();
#endif

#ifdef ENABLE_STREAM_CHAT
    // Clean up FreeRTOS mutex
    if (_streamMutex != nullptr) {
        vSemaphoreDelete(_streamMutex);
        _streamMutex = nullptr;
    }
#endif
}

// Cleanup helper
void ESP32_AI_Connect::_cleanupHandler() {
    delete _platformHandler;
    _platformHandler = nullptr;
}

#ifdef ENABLE_AUTO_RETRY
// --- Connection Resilience Helper Methods ---

// Check if WiFi is connected
bool ESP32_AI_Connect::_checkWiFiConnected() {
    if (WiFi.status() != WL_CONNECTED) {
        _lastError = "WiFi not connected. Please reconnect WiFi and try again.";
        return false;
    }
    return true;
}

// Cleanup stale connections if threshold exceeded
void ESP32_AI_Connect::_cleanupStaleConnection() {
    // If this is the first request or within threshold, skip cleanup
    if (_lastSuccessfulRequestTime == 0) {
        return; // First request, no need to cleanup
    }
    
    unsigned long timeSinceLastSuccess = millis() - _lastSuccessfulRequestTime;
    
    // Check for millis() rollover (occurs every ~49 days)
    // If current millis is less than last success time, rollover occurred
    if (millis() < _lastSuccessfulRequestTime) {
        // After rollover, reset the timestamp and skip cleanup this time
        _lastSuccessfulRequestTime = millis();
        return;
    }
    
    // If connection is stale, cleanup and reinitialize
    if (timeSinceLastSuccess > AUTO_RETRY_STALE_CONNECTION_THRESHOLD_MS) {
        #ifdef ENABLE_DEBUG_OUTPUT
        Serial.println("[Auto-Retry] Stale connection detected. Cleaning up...");
        #endif
        
        _httpClient.end();
        _wifiClient.stop();
        delay(100); // Brief delay to ensure cleanup completes
        
        #ifdef ENABLE_DEBUG_OUTPUT
        Serial.println("[Auto-Retry] Connection cleanup complete.");
        #endif
    }
}

// Determine if an HTTP error code is retryable
bool ESP32_AI_Connect::_isRetryableError(int httpCode) {
    // Negative codes are HTTPClient errors (timeout, connection failed, etc.)
    if (httpCode < 0) {
        return true; // Retry on network/connection errors
    }
    
    // 5xx server errors are retryable
    if (httpCode >= 500 && httpCode <= 599) {
        return true;
    }
    
    // All other codes (2xx success, 4xx client errors) are not retryable
    return false;
}

// Calculate retry delay using exponential backoff
uint32_t ESP32_AI_Connect::_calculateRetryDelay(int attemptNumber) {
    // attemptNumber: 1, 2, 3, ...
    // delays: 1000ms, 2000ms, 4000ms, 8000ms (capped at 10000ms)
    uint32_t delay = AUTO_RETRY_INITIAL_DELAY_MS;
    
    for (int i = 1; i < attemptNumber; i++) {
        delay = delay * 2;
        if (delay > AUTO_RETRY_MAX_DELAY_MS) {
            delay = AUTO_RETRY_MAX_DELAY_MS;
            break;
        }
    }
    
    return delay;
}
#endif // ENABLE_AUTO_RETRY

// Initialization / Re-initialization logic
bool ESP32_AI_Connect::begin(const char* platformIdentifier, const char* apiKey, const char* modelName) {
    return begin(platformIdentifier, apiKey, modelName, nullptr);
}

// New begin method with custom endpoint
bool ESP32_AI_Connect::begin(const char* platformIdentifier, const char* apiKey, const char* modelName, const char* endpointUrl) {
    _apiKey = apiKey;
    _modelName = modelName;
    _customEndpoint = endpointUrl ? endpointUrl : "";  // Store custom endpoint if provided
    _lastError = "";

    _cleanupHandler(); // Delete previous handler if any

    String platformStr = platformIdentifier;
    platformStr.toLowerCase(); // Case-insensitive comparison

    // --- Conditionally Create Platform Handler Instance ---
    #ifdef USE_AI_API_OPENAI
    if (platformStr == "openai" || platformStr == "openai-compatible") {
        _platformHandler = new AI_API_OpenAI_Handler();
    } else
    #endif

    #ifdef USE_AI_API_GEMINI
    if (platformStr == "gemini") {
        _platformHandler = new AI_API_Gemini_Handler(); 
    } else
    #endif

    #ifdef USE_AI_API_DEEPSEEK
    if (platformStr == "deepseek") {
        _platformHandler = new AI_API_DeepSeek_Handler();
    } else
    #endif

    #ifdef USE_AI_API_CLAUDE
    if (platformStr == "claude") {
        _platformHandler = new AI_API_Claude_Handler();
    } else
    #endif

    #ifdef USE_AI_API_GROK
    if (platformStr == "grok") {
        _platformHandler = new AI_API_Grok_Handler();
    } else
    #endif

    { // Default case if no match found or platform not compiled
        if (_platformHandler == nullptr) { // Only set error if no handler was created
             _lastError = "Platform '" + String(platformIdentifier) + "' is not supported or not enabled in ESP32_AI_Connect_config.h";
             Serial.println("ERROR: " + _lastError);
             return false; // Indicate failure
        }
    }

    return true; // Indicate success
}

