rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
// --- Configuration Setters ---
// Sets the System Role for a standard chat request to define the system's behavior in the conversation.
void ESP32_AI_Connect::setChatSystemRole(const char* systemRole) { _systemRole = systemRole; }
// Configures the Temperature parameter of a standard chat request to control the randomness of generated responses.
void ESP32_AI_Connect::setChatTemperature(float temperature) { _temperature = constrain(temperature, 0.0, 2.0); }
// Defines the maximum number of tokens for a standard chat request to limit the length of generated responses.
void ESP32_AI_Connect::setChatMaxTokens(int maxTokens) { _maxTokens = max(1, maxTokens); }

// --- Configuration Getters ---
// Returns the current System Role set for standard chat requests.
String ESP32_AI_Connect::getChatSystemRole() const {
    return _systemRole;
}

// Returns the current Temperature value set for standard chat requests.
float ESP32_AI_Connect::getChatTemperature() const {
    return _temperature;
}

// Returns the current Maximum Tokens value set for standard chat requests.
int ESP32_AI_Connect::getChatMaxTokens() const {
    return _maxTokens;
}

// --- Custom Parameters Methods ---
// Sets custom parameters for standard chat requests in JSON format
bool ESP32_AI_Connect::setChatParameters(String userParameterJsonStr) {
    // If empty string, clear the parameters
    if (userParameterJsonStr.isEmpty()) {
        _chatCustomParams = "";
        return true;
    }
    
    // Validate JSON format
    DynamicJsonDocument tempDoc(512); // Temporary document for validation
    DeserializationError error = deserializeJson(tempDoc, userParameterJsonStr);
    
    if (error) {
        _lastError = "Invalid JSON in custom parameters: " + String(error.c_str());
        return false;
    }
    
    // Store validated JSON string
    _chatCustomParams = userParameterJsonStr;
    return true;
}

// Returns the current custom parameters set for standard chat requests
String ESP32_AI_Connect::getChatParameters() const {
    return _chatCustomParams;
}

// --- Raw Response Access Methods ---
String ESP32_AI_Connect::getChatRawResponse() const {
    return _chatRawResponse;
}

String ESP32_AI_Connect::getTCRawResponse() const {
    return _tcRawResponse;
}

// Returns the HTTP response code from the last chat request
int ESP32_AI_Connect::getChatResponseCode() const {
    return _chatResponseCode;
}

// Returns the HTTP response code from the last tcChat request
int ESP32_AI_Connect::getTCChatResponseCode() const {
    return _tcChatResponseCode;
}

// Returns the HTTP response code from the last tcReply request
int ESP32_AI_Connect::getTCReplyResponseCode() const {
    return _tcReplyResponseCode;
}

// --- Reset Methods ---
void ESP32_AI_Connect::chatReset() {
    _chatRawResponse = "";
    _chatResponseCode = 0;     // Reset the stored HTTP response code
    _systemRole = "";     // Reset system role set by setChatSystemRole
    _temperature = -1.0;  // Reset temperature set by setChatTemperature to API default
    _maxTokens = -1;      // Reset max tokens set by setChatMaxTokens to API default
    _chatCustomParams = ""; // Reset custom parameters to empty string
}

// --- Get Last Error ---
String ESP32_AI_Connect::getLastError() const {
    return _lastError;
}

// --- Get Total Tokens ---
int ESP32_AI_Connect::getTotalTokens() const {
    if (_platformHandler) {
        return _platformHandler->getTotalTokens();
    }
    return 0;
}

// --- Get Finish Reason ---
String ESP32_AI_Connect::getFinishReason() const {
    if (_platformHandler) {
        return _platformHandler->getFinishReason();
    }
    return ""; // Return empty if no handler
}

#ifdef ENABLE_TOOL_CALLS
// --- Tool Calls Configuration Setters ---
void ESP32_AI_Connect::setTCChatSystemRole(const String& systemRole) {
    _tcSystemRole = systemRole;
}

void ESP32_AI_Connect::setTCChatMaxTokens(int maxTokens) {
    if (maxTokens > 0) {
        _tcMaxToken = maxTokens;
    }
}

void ESP32_AI_Connect::setTCChatToolChoice(const String& toolChoice) {
    _tcToolChoice = toolChoice;
}

// --- Tool Calls Configuration Getters ---
String ESP32_AI_Connect::getTCChatSystemRole() const {
    return _tcSystemRole;
}

int ESP32_AI_Connect::getTCChatMaxTokens() const {
    return _tcMaxToken;
}

String ESP32_AI_Connect::getTCChatToolChoice() const {
    return _tcToolChoice;
}

// --- Tool Calls Follow-up Configuration Setters ---
void ESP32_AI_Connect::setTCReplyMaxTokens(int maxTokens) {
    if (maxTokens > 0) {
        _tcFollowUpMaxToken = maxTokens;
    }
}

void ESP32_AI_Connect::setTCReplyToolChoice(const String& toolChoice) {
    _tcFollowUpToolChoice = toolChoice;
}

// --- Tool Calls Follow-up Configuration Getters ---
int ESP32_AI_Connect::getTCReplyMaxTokens() const {
    return _tcFollowUpMaxToken;
}

String ESP32_AI_Connect::getTCReplyToolChoice() const {
    return _tcFollowUpToolChoice;
}

// --- Tool Setup ---
bool ESP32_AI_Connect::setTCTools(String* tcTools, int tcToolsSize) {
    _lastError = "";
    
    // --- VALIDATION STEP 1: Check total length ---
    size_t totalLength = 0;
    
    // Calculate total length of all tools
    for (int i = 0; i < tcToolsSize; i++) {
        totalLength += tcTools[i].length();
    }
    
    // Check against maximum allowed size (adjust this value as needed)
    const size_t MAX_TOTAL_TC_LENGTH = AI_API_REQ_JSON_DOC_SIZE / 2; // Use half of request doc size as rough limit
    if (totalLength > MAX_TOTAL_TC_LENGTH) {
        _lastError = "Tool calls definition too large. Total size: " + String(totalLength) + 
                    " bytes, maximum allowed: " + String(MAX_TOTAL_TC_LENGTH) + " bytes.";
        return false;
    }
    
    // --- VALIDATION STEP 2: Validate JSON format of each tool ---
    for (int i = 0; i < tcToolsSize; i++) {
        _reqDoc.clear(); // Reuse request document for JSON validation
        DeserializationError error = deserializeJson(_reqDoc, tcTools[i]);
        
        if (error) {
            _lastError = "Invalid JSON in tool #" + String(i+1) + ": " + String(error.c_str());
            return false;
        }
        
        // Check for required fields in each tool - support both formats:
        // 1. Our simplified format: {"name": "...", "description": "...", "parameters": {...}}
        // 2. OpenAI format: {"type": "function", "function": {"name": "...", ...}}
        bool hasName = false;
        bool hasParameters = false;
        
        if (_reqDoc.containsKey("name")) {
            // Format 1 - Our simplified format
            hasName = true;
            hasParameters = _reqDoc.containsKey("parameters");
        } else if (_reqDoc.containsKey("type") && _reqDoc.containsKey("function")) {
            // Format 2 - OpenAI format with type and function
            JsonObject function = _reqDoc["function"];
            if (function.containsKey("name")) {
                hasName = true;
            }
            if (function.containsKey("parameters")) {
                hasParameters = true;
            }
        }
        
        if (!hasName) {
            _lastError = "Missing 'name' field in tool #" + String(i+1);
            return false;
        }
        
        if (!hasParameters) {
            _lastError = "Missing 'parameters' field in tool #" + String(i+1);
            return false;
        }
    }
    
