rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
    // --- Clean up previous tools array if exists ---
    if (_tcToolsArray != nullptr) {
        delete[] _tcToolsArray;
        _tcToolsArray = nullptr;
        _tcToolsArraySize = 0;
    }
    
    // --- Store the validated tool calls configuration ---
    if (tcToolsSize > 0) {
        _tcToolsArray = new String[tcToolsSize];
        if (_tcToolsArray == nullptr) {
            _lastError = "Memory allocation failed for tool calls array.";
            return false;
        }
        
        // Copy tool definitions
        for (int i = 0; i < tcToolsSize; i++) {
            _tcToolsArray[i] = tcTools[i];
        }
        _tcToolsArraySize = tcToolsSize;
    }
    
    return true;
}

// --- Reset Tool Calls ---
void ESP32_AI_Connect::tcChatReset() {
    _lastUserMessage = "";
    _lastAssistantToolCallsJson = "";
    _lastMessageWasToolCalls = false;
    _tcRawResponse = ""; // Clear the raw tool calling response
    _tcChatResponseCode = 0; // Reset the stored tcChat HTTP response code
    _tcReplyResponseCode = 0; // Reset the stored tcReply HTTP response code

    // Clean up conversation document if allocated
    if (_tcConversationDoc != nullptr) {
        delete _tcConversationDoc;
        _tcConversationDoc = nullptr;
    }

    // Reset but don't delete tool definitions
    // If users want to clear tools, they need to call setTCTools with empty array

    // Reset configuration to defaults
    _tcSystemRole = "";
    _tcMaxToken = -1;
    _tcToolChoice = "";

    // Reset follow-up configuration to defaults
    _tcFollowUpMaxToken = -1;
    _tcFollowUpToolChoice = "";
}

// --- Perform Tool Calls Chat ---
String ESP32_AI_Connect::tcChat(const String& tcUserMessage) {
    _lastError = "";
    _tcRawResponse = ""; // Clear previous raw response
    _tcChatResponseCode = 0; // Reset response code
    
    // Check if platform handler is initialized
    if (!_platformHandler) {
        _lastError = "Platform handler not initialized. Call begin() with a supported platform.";
        return "";
    }
    
    // Check if tool calls setup has been performed
    if (_tcToolsArray == nullptr || _tcToolsArraySize == 0) {
        _lastError = "Tool calls not set up. Call setTCTools() first.";
        return "";
    }

#ifdef ENABLE_AUTO_RETRY
    // Check WiFi connection before attempting request
    if (!_checkWiFiConnected()) {
        return ""; // Error message already set by _checkWiFiConnected()
    }
    
    // Cleanup stale connections if needed
    _cleanupStaleConnection();
#endif
    
    // Reset conversation tracking for new chat
    _lastUserMessage = tcUserMessage;
    _lastAssistantToolCallsJson = "";
    _lastMessageWasToolCalls = false;
    
    // Get endpoint URL (same as regular chat)
    String url = _platformHandler->getEndpoint(_modelName, _apiKey, _customEndpoint);
    if (url.isEmpty()) {
        _lastError = "Failed to get endpoint URL from platform handler.";
        return "";
    }
    
    // Build request body using the platform handler's tool calls method
    String requestBody = _platformHandler->buildToolCallsRequestBody(
        _modelName, _tcToolsArray, _tcToolsArraySize, 
        _tcSystemRole, _tcToolChoice, _tcMaxToken, tcUserMessage, _reqDoc);
    
    if (requestBody.isEmpty()) {
        if (_lastError.isEmpty()) _lastError = "Failed to build tool calls request body.";
        return "";
    }

#ifdef ENABLE_AUTO_RETRY
    // --- Retry Loop ---
    int maxAttempts = AUTO_RETRY_MAX_ATTEMPTS + 1; // +1 for initial attempt
    for (int attempt = 1; attempt <= maxAttempts; attempt++) {
        #ifdef ENABLE_DEBUG_OUTPUT
        if (attempt > 1) {
            Serial.printf("[Auto-Retry] Tool Call Attempt %d/%d\n", attempt, maxAttempts);
        }
        #endif
#endif // ENABLE_AUTO_RETRY
    
    #ifdef ENABLE_DEBUG_OUTPUT
    Serial.println("---------- AI Tool Calls Request ----------");
    Serial.println("URL: " + url);
    Serial.println("Body: " + requestBody);
    Serial.println("-------------------------------------------");
    #endif
    
    // Perform HTTP POST Request (same pattern as regular chat)
    _httpClient.end(); // Ensure previous connection is closed
    if (_httpClient.begin(_wifiClient, url)) {
        _platformHandler->setHeaders(_httpClient, _apiKey); // Same headers as regular chat
        _httpClient.setTimeout(AI_API_HTTP_TIMEOUT_MS);
        int httpCode = _httpClient.POST(requestBody);
        
        // Store the HTTP response code
        _tcChatResponseCode = httpCode;
        
        // Handle Response
        if (httpCode > 0) {
            String responsePayload = _httpClient.getString();
            // Store the raw response
            _tcRawResponse = responsePayload;
            
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.println("---------- AI Tool Calls Response ----------");
            Serial.println("HTTP Code: " + String(httpCode));
            Serial.println("Payload: " + responsePayload);
            Serial.println("--------------------------------------------");
            #endif
            
            if (httpCode == HTTP_CODE_OK) {
                // Parse response using the platform handler's tool calls response parser
                String responseContent = _platformHandler->parseToolCallsResponseBody(
                    responsePayload, _lastError, _respDoc);
                
                if (responseContent.isEmpty() && _lastError.isEmpty()) {
                    _lastError = "Handler failed to parse tool calls response.";
                } else {
                    // Track finish reason for potential follow-up
                    String finishReason = _platformHandler->getFinishReason();
                    if (finishReason == "tool_calls" || finishReason == "tool_use") {
                        _lastMessageWasToolCalls = true;
                        _lastAssistantToolCallsJson = responseContent;
                    } else {
                        _lastMessageWasToolCalls = false;
                    }
                }
                
#ifdef ENABLE_AUTO_RETRY
                // Success! Update timestamp and return
                _lastSuccessfulRequestTime = millis();
#endif
                _httpClient.end(); // Clean up connection
                return responseContent;
            } else {
                _lastError = "HTTP Error: " + String(httpCode) + " - Response: " + responsePayload;
            }
        } else {
            _lastError = String("HTTP Request Failed: ") + _httpClient.errorToString(httpCode).c_str();
        }
        _httpClient.end(); // Clean up connection
    } else {
        _lastError = "HTTP Client failed to begin connection to: " + url;
    }

#ifdef ENABLE_AUTO_RETRY
        // Check if we should retry
        if (attempt < maxAttempts && _isRetryableError(_tcChatResponseCode)) {
            uint32_t retryDelay = _calculateRetryDelay(attempt);
            
