rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.printf("[Auto-Retry] Tool call failed (HTTP %d), retrying in %dms...\n", 
                         _tcChatResponseCode, retryDelay);
            #endif
            
            delay(retryDelay);
            // Loop continues to next attempt
        } else {
            // Either exhausted retries or non-retryable error
            #ifdef ENABLE_DEBUG_OUTPUT
            if (attempt >= maxAttempts) {
                Serial.printf("[Auto-Retry] Tool call failed after %d attempts\n", maxAttempts);
            } else {
                Serial.println("[Auto-Retry] Non-retryable error, aborting");
            }
            #endif
            break; // Exit retry loop
        }
    } // End retry loop
#endif // ENABLE_AUTO_RETRY
    
    return ""; // Return empty string on error
}

// --- Reply to Tool Calls with Results ---
String ESP32_AI_Connect::tcReply(const String& toolResultsJson) {
    _lastError = "";
    _tcRawResponse = ""; // Clear previous raw response
    _tcReplyResponseCode = 0; // Reset response code
    
    // Check if platform handler is initialized
    if (!_platformHandler) {
        _lastError = "Platform handler not initialized. Call begin() with a supported platform.";
        return "";
    }
    
    // Check if tool calls setup has been performed
    if (_tcToolsArray == nullptr || _tcToolsArraySize == 0) {
        _lastError = "Tool calls not set up. Call setTCTools() first.";
        return "";
    }
    
    // Check if the last message was a tool call
    if (!_lastMessageWasToolCalls) {
        _lastError = "No tool calls to reply to. Call tcChat first and ensure it returns tool calls.";
        return "";
    }
    
    // --- Validate toolResultsJson ---
    // Check length
    if (toolResultsJson.length() > AI_API_REQ_JSON_DOC_SIZE / 2) {
        _lastError = "Tool results JSON too large. Maximum size: " + 
                    String(AI_API_REQ_JSON_DOC_SIZE / 2) + " bytes.";
        return "";
    }
    
    // Validate JSON format
    _reqDoc.clear();
    DeserializationError error = deserializeJson(_reqDoc, toolResultsJson);
    if (error) {
        _lastError = "Invalid JSON in tool results: " + String(error.c_str());
        return "";
    }
    
    // Check basic structure
    if (!_reqDoc.is<JsonArray>()) {
        _lastError = "Tool results must be a JSON array.";
        return "";
    }
    
    // Validate each tool result
    JsonArray resultsArray = _reqDoc.as<JsonArray>();
    for (JsonObject result : resultsArray) {
        if (!result.containsKey("tool_call_id")) {
            _lastError = "Each tool result must have a 'tool_call_id' field.";
            return "";
        }
        if (!result.containsKey("function")) {
            _lastError = "Each tool result must have a 'function' field.";
            return "";
        }
        JsonObject function = result["function"];
        if (!function.containsKey("name")) {
            _lastError = "Each tool result function must have a 'name' field.";
            return "";
        }
        if (!function.containsKey("output")) {
            _lastError = "Each tool result function must have an 'output' field.";
            return "";
        }
    }
    
    // --- Build and send the follow-up request ---
    String url = _platformHandler->getEndpoint(_modelName, _apiKey, _customEndpoint);
    if (url.isEmpty()) {
        _lastError = "Failed to get endpoint URL from platform handler.";
        return "";
    }
    
    // Build request body using the platform handler's tool calls follow-up method
    String requestBody = _platformHandler->buildToolCallsFollowUpRequestBody(
        _modelName, _tcToolsArray, _tcToolsArraySize,
        _tcSystemRole, _tcToolChoice,
        _lastUserMessage, _lastAssistantToolCallsJson,
        toolResultsJson, _tcFollowUpMaxToken, _tcFollowUpToolChoice, _reqDoc);
    
    if (requestBody.isEmpty()) {
        if (_lastError.isEmpty()) _lastError = "Failed to build tool calls follow-up request body.";
        return "";
    }
    
    #ifdef ENABLE_DEBUG_OUTPUT
    Serial.println("---------- AI Tool Calls Follow-up Request ----------");
    Serial.println("URL: " + url);
    Serial.println("Body: " + requestBody);
    Serial.println("--------------------------------------------------");
    #endif
    
    // Perform HTTP POST Request
    _httpClient.end(); // Ensure previous connection is closed
    if (_httpClient.begin(_wifiClient, url)) {
        _platformHandler->setHeaders(_httpClient, _apiKey);
        _httpClient.setTimeout(AI_API_HTTP_TIMEOUT_MS);
        int httpCode = _httpClient.POST(requestBody);
        
        // Store the HTTP response code
        _tcReplyResponseCode = httpCode;
        
        // Handle Response
        if (httpCode > 0) {
            String responsePayload = _httpClient.getString();
            // Store the raw response
            _tcRawResponse = responsePayload;
            
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.println("---------- AI Tool Calls Follow-up Response ----------");
            Serial.println("HTTP Code: " + String(httpCode));
            Serial.println("Payload: " + responsePayload);
            Serial.println("-----------------------------------------------------");
            #endif
            
            if (httpCode == HTTP_CODE_OK) {
                // Parse response - same as regular tool calls
                String responseContent = _platformHandler->parseToolCallsResponseBody(
                    responsePayload, _lastError, _respDoc);
                
                if (responseContent.isEmpty() && _lastError.isEmpty()) {
                    _lastError = "Handler failed to parse tool calls follow-up response.";
                } else {
                    // Track finish reason for potential further follow-up
                    String finishReason = _platformHandler->getFinishReason();
                    if (finishReason == "tool_calls" || finishReason == "tool_use") {
                        // If the response requests more tool calls, update tracking
                        _lastMessageWasToolCalls = true;
                        _lastAssistantToolCallsJson = responseContent;
                        // Note: we don't update _lastUserMessage as we want to maintain the original context
                    } else {
                        // If the response is a regular message, mark that we can't do more follow-ups
                        _lastMessageWasToolCalls = false;
                    }
                }
                
                _httpClient.end(); // Clean up connection
                return responseContent;
            } else {
                _lastError = "HTTP Error: " + String(httpCode) + " - Response: " + responsePayload;
            }
        } else {
            _lastError = String("HTTP Request Failed: ") + _httpClient.errorToString(httpCode).c_str();
        }
        _httpClient.end(); // Clean up connection
    } else {
        _lastError = "HTTP Client failed to begin connection to: " + url;
    }
    
