rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
    return ""; // Return empty string on error
}
#endif // ENABLE_TOOL_CALLS

// --- Main Chat Function (Delegates to Handler) ---
String ESP32_AI_Connect::chat(const String& userMessage) {
    _lastError = "";
    String responseContent = "";
    _chatRawResponse = ""; // Clear previous raw response
    _chatResponseCode = 0; // Reset response code

    if (!_platformHandler) {
        _lastError = "Platform handler not initialized. Call begin() with a supported platform.";
        return "";
    }

#ifdef ENABLE_AUTO_RETRY
    // Check WiFi connection before attempting request
    if (!_checkWiFiConnected()) {
        return ""; // Error message already set by _checkWiFiConnected()
    }
    
    // Cleanup stale connections if needed
    _cleanupStaleConnection();
#endif

    // Get endpoint URL from handler, passing the custom endpoint if set
    String url = _platformHandler->getEndpoint(_modelName, _apiKey, _customEndpoint);
    if (url.isEmpty()) {
        _lastError = "Failed to get endpoint URL from platform handler.";
        return "";
    }

    // Build request body using handler and shared JSON doc
    // Using values set by setChatSystemRole, setChatTemperature, setChatMaxTokens, and setChatParameters
    String requestBody = _platformHandler->buildRequestBody(_modelName, _systemRole,
                                                            _temperature, _maxTokens,
                                                            userMessage, _reqDoc, _chatCustomParams);
    if (requestBody.isEmpty()) {
        // Assume handler sets _lastError or check its return value pattern if defined
        if (_lastError.isEmpty()) _lastError = "Failed to build request body (handler returned empty).";
        return "";
    }

#ifdef ENABLE_AUTO_RETRY
    // --- Retry Loop ---
    int maxAttempts = AUTO_RETRY_MAX_ATTEMPTS + 1; // +1 for initial attempt
    for (int attempt = 1; attempt <= maxAttempts; attempt++) {
        #ifdef ENABLE_DEBUG_OUTPUT
        if (attempt > 1) {
            Serial.printf("[Auto-Retry] Attempt %d/%d\n", attempt, maxAttempts);
        }
        #endif
#endif // ENABLE_AUTO_RETRY

    #ifdef ENABLE_DEBUG_OUTPUT
     // --- Debug Start: Request ---
     Serial.println("---------- AI Request ----------");
     Serial.println("URL: " + url);
     Serial.println("Body: " + requestBody);
     Serial.println("-------------------------------");
     // --- Debug End: Request ---
    #endif // ENABLE_DEBUG_OUTPUT

    // --- Perform HTTP POST Request ---
    _httpClient.end(); // Ensure previous connection is closed
    if (_httpClient.begin(_wifiClient, url)) {
        _platformHandler->setHeaders(_httpClient, _apiKey); // Set headers via handler
        _httpClient.setTimeout(AI_API_HTTP_TIMEOUT_MS); // Use configured timeout
        int httpCode = _httpClient.POST(requestBody);
        
        // Store the HTTP response code
        _chatResponseCode = httpCode;

        // --- Handle Response ---
        if (httpCode > 0) {
            String responsePayload = _httpClient.getString();
            // Store the raw response
            _chatRawResponse = responsePayload;
            
            #ifdef ENABLE_DEBUG_OUTPUT
            // --- Debug Start: Response ---
            Serial.println("---------- AI Response ----------");
            Serial.println("HTTP Code: " + String(httpCode));
            Serial.println("Payload: " + responsePayload);
            Serial.println("--------------------------------");
            // --- Debug End: Response ---
            #endif // ENABLE_DEBUG_OUTPUT

            if (httpCode == HTTP_CODE_OK) {
                // Parse response using handler and shared JSON doc
                // Handler's parseResponseBody should set _lastError on failure
                responseContent = _platformHandler->parseResponseBody(responsePayload, _lastError, _respDoc);
                // If responseContent is "" but _lastError is also "", handler failed silently
                if(responseContent.isEmpty() && _lastError.isEmpty()){
                    _lastError = "Handler failed to parse response or returned empty content.";
                }
                
#ifdef ENABLE_AUTO_RETRY
                // Success! Update timestamp and return
                _lastSuccessfulRequestTime = millis();
#endif
                _httpClient.end(); // Clean up connection
                return responseContent;
            } else {
                _lastError = "HTTP Error: " + String(httpCode) + " - Response: " + responsePayload;
            }
        } else {
            _lastError = String("HTTP Request Failed: ") + _httpClient.errorToString(httpCode).c_str();
        }
        _httpClient.end(); // Clean up connection
    } else {
         _lastError = "HTTP Client failed to begin connection to: " + url;
    }

#ifdef ENABLE_AUTO_RETRY
        // Check if we should retry
        if (attempt < maxAttempts && _isRetryableError(_chatResponseCode)) {
            uint32_t retryDelay = _calculateRetryDelay(attempt);
            
            #ifdef ENABLE_DEBUG_OUTPUT
            Serial.printf("[Auto-Retry] Request failed (HTTP %d), retrying in %dms...\n", 
                         _chatResponseCode, retryDelay);
            #endif
            
            delay(retryDelay);
            // Loop continues to next attempt
        } else {
            // Either exhausted retries or non-retryable error
            #ifdef ENABLE_DEBUG_OUTPUT
            if (attempt >= maxAttempts) {
                Serial.printf("[Auto-Retry] Request failed after %d attempts\n", maxAttempts);
            } else {
                Serial.println("[Auto-Retry] Non-retryable error, aborting");
            }
            #endif
            break; // Exit retry loop
        }
    } // End retry loop
#endif // ENABLE_AUTO_RETRY

    return responseContent; // Return the parsed content or empty string on error
}

#ifdef ENABLE_STREAM_CHAT
// --- Enhanced Thread-Safe Helper Methods ---

// Thread-safe helper methods
bool ESP32_AI_Connect::_acquireStreamLock(uint32_t timeoutMs) const {
    if (_streamMutex == nullptr) return false;
    return xSemaphoreTake(_streamMutex, pdMS_TO_TICKS(timeoutMs)) == pdTRUE;
}

void ESP32_AI_Connect::_releaseStreamLock() const {
    if (_streamMutex != nullptr) {
        xSemaphoreGive(_streamMutex);
    }
}

bool ESP32_AI_Connect::_setStreamState(StreamState newState) {
    if (!_acquireStreamLock(100)) return false;
    
    StreamState oldState = _streamState;
    _streamState = newState;
    
