rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
    #ifdef ENABLE_DEBUG_OUTPUT
    Serial.printf("Stream state: %d -> %d\n", (int)oldState, (int)newState);
    #endif
    
    _releaseStreamLock();
    return true;
}

ESP32_AI_Connect::StreamState ESP32_AI_Connect::_getStreamState() const {
    // Atomic read of volatile variable - no lock needed for simple read
    return _streamState;
}

// --- Streaming Chat Implementation ---

// Streaming parameter setters (separate from regular chat)
void ESP32_AI_Connect::setStreamChatSystemRole(const char* systemRole) { 
    if (_acquireStreamLock(100)) {
        _streamSystemRole = systemRole;
        _releaseStreamLock();
    }
}

void ESP32_AI_Connect::setStreamChatTemperature(float temperature) { 
    if (_acquireStreamLock(100)) {
        _streamTemperature = constrain(temperature, 0.0, 2.0);
        _releaseStreamLock();
    }
}

void ESP32_AI_Connect::setStreamChatMaxTokens(int maxTokens) { 
    if (_acquireStreamLock(100)) {
        _streamMaxTokens = max(1, maxTokens);
        _releaseStreamLock();
    }
}

bool ESP32_AI_Connect::setStreamChatParameters(String userParameterJsonStr) {
    // If empty string, clear the parameters
    if (userParameterJsonStr.isEmpty()) {
        if (_acquireStreamLock(100)) {
            _streamCustomParams = "";
            _releaseStreamLock();
        }
        return true;
    }
    
    // Validate JSON format
    DynamicJsonDocument tempDoc(512); // Temporary document for validation
    DeserializationError error = deserializeJson(tempDoc, userParameterJsonStr);
    
    if (error) {
        _lastError = "Invalid JSON in streaming custom parameters: " + String(error.c_str());
        return false;
    }
    
    // Store validated JSON string with thread safety
    if (_acquireStreamLock(100)) {
        _streamCustomParams = userParameterJsonStr;
        _releaseStreamLock();
    }
    return true;
}

// Streaming parameter getters
String ESP32_AI_Connect::getStreamChatSystemRole() const {
    if (_acquireStreamLock(100)) {
        String result = _streamSystemRole;
        _releaseStreamLock();
        return result;
    }
    return "";
}

float ESP32_AI_Connect::getStreamChatTemperature() const {
    if (_acquireStreamLock(100)) {
        float result = _streamTemperature;
        _releaseStreamLock();
        return result;
    }
    return -1.0;
}

int ESP32_AI_Connect::getStreamChatMaxTokens() const {
    if (_acquireStreamLock(100)) {
        int result = _streamMaxTokens;
        _releaseStreamLock();
        return result;
    }
    return -1;
}

String ESP32_AI_Connect::getStreamChatParameters() const {
    if (_acquireStreamLock(100)) {
        String result = _streamCustomParams;
        _releaseStreamLock();
        return result;
    }
    return "";
}

// Streaming control methods
bool ESP32_AI_Connect::isStreaming() const {
    StreamState state = _getStreamState();
    return (state == StreamState::ACTIVE || state == StreamState::STARTING);
}

void ESP32_AI_Connect::stopStreaming() {
    StreamState currentState = _getStreamState();
    
    if (currentState == StreamState::ACTIVE || currentState == StreamState::STARTING) {
        _setStreamState(StreamState::STOPPING);
    }
}

ESP32_AI_Connect::StreamState ESP32_AI_Connect::getStreamState() const {
    return _getStreamState();
}

// Enhanced streaming status methods
uint32_t ESP32_AI_Connect::getStreamChunkCount() const {
    return _streamChunkCount; // Atomic read of volatile
}

uint32_t ESP32_AI_Connect::getStreamTotalBytes() const {
    return _streamTotalBytes; // Atomic read of volatile
}

uint32_t ESP32_AI_Connect::getStreamElapsedTime() const {
    if (_streamStartTime == 0) return 0;
    return millis() - _streamStartTime;
}

String ESP32_AI_Connect::getStreamChatRawResponse() const {
    if (_acquireStreamLock(100)) {
        String response = _streamRawResponse;
        _releaseStreamLock();
        return response;
    }
    return "";
}

int ESP32_AI_Connect::getStreamChatResponseCode() const {
    if (_acquireStreamLock(100)) {
        int code = _streamResponseCode;
        _releaseStreamLock();
        return code;
    }
    return 0;
}

void ESP32_AI_Connect::streamChatReset() {
    if (!_acquireStreamLock(1000)) return;
    
    _streamState = StreamState::IDLE;
    _streamCallback = nullptr;
    _streamRawResponse = "";
    _streamResponseCode = 0;
    _streamChunkCount = 0;
    _streamTotalBytes = 0;
    _streamStartTime = 0;
    _streamSystemRole = "";
    _streamTemperature = -1.0;
    _streamMaxTokens = -1;
    _streamCustomParams = "";
    
    _releaseStreamLock();
}

// Enhanced thread-safe streaming method
bool ESP32_AI_Connect::streamChat(const String& userMessage, StreamCallback callback) {
    // Quick state check without lock first
    if (_getStreamState() != StreamState::IDLE) {
        _lastError = "Streaming operation already in progress";
        return false;
    }

#ifdef ENABLE_AUTO_RETRY
    // Check WiFi connection before attempting streaming (no retry for streaming)
    if (!_checkWiFiConnected()) {
        return false; // Error message already set by _checkWiFiConnected()
    }
    
    // Cleanup stale connections if needed
    _cleanupStaleConnection();
#endif
    
    // Acquire lock for critical section
    if (!_acquireStreamLock(1000)) {
        _lastError = "Failed to acquire stream lock (timeout)";
        return false;
    }
    
    // Double-check state under lock (classic double-checked locking pattern)
    if (_streamState != StreamState::IDLE) {
        _lastError = "Streaming operation already in progress";
        _releaseStreamLock();
        return false;
    }
    
    // Validate inputs
    if (!_platformHandler) {
        _lastError = "Platform handler not initialized";
        _releaseStreamLock();
        return false;
    }
    
    if (!callback) {
        _lastError = "Callback function is null";
        _releaseStreamLock();
        return false;
    }
    
    // Initialize streaming state
    _streamState = StreamState::STARTING;
    _streamCallback = callback;
    _streamChunkCount = 0;
    _streamTotalBytes = 0;
    _streamStartTime = millis();
    _streamRawResponse = "";
    _streamResponseCode = 0;
    _lastError = "";
    
