rizzaripaganini/Arduino/sketchbook/libraries/ESP32_AI_Connect/src/ESP32_AI_Connect.cpp
    _releaseStreamLock();
    
    // Get endpoint URL from handler - use streaming endpoint if available
    String url = _platformHandler->getStreamEndpoint(_modelName, _apiKey, _customEndpoint);
    
    if (url.isEmpty()) {
        _lastError = "Failed to get endpoint URL from platform handler";
        _setStreamState(StreamState::ERROR);
        return false;
    }

    // Build streaming request body using handler (get parameters safely)
    String systemRole, customParams;
    float temperature;
    int maxTokens;
    
    if (_acquireStreamLock(100)) {
        systemRole = _streamSystemRole;
        temperature = _streamTemperature;
        maxTokens = _streamMaxTokens;
        customParams = _streamCustomParams;
        _releaseStreamLock();
    }
    
    String requestBody = _platformHandler->buildStreamRequestBody(_modelName, systemRole,
                                                                 temperature, maxTokens,
                                                                 userMessage, _reqDoc, customParams);
    if (requestBody.isEmpty()) {
        if (_lastError.isEmpty()) _lastError = "Failed to build streaming request body";
        _setStreamState(StreamState::ERROR);
        return false;
    }

    #ifdef ENABLE_DEBUG_OUTPUT
    Serial.println("---------- AI Streaming Request ----------");
    Serial.println("URL: " + url);
    Serial.println("Body: " + requestBody);
    Serial.println("------------------------------------------");
    #endif

    // Perform streaming setup (outside of lock to avoid blocking)
    bool success = _processStreamResponse(url, requestBody);
    
    if (success) {
        // Successful completion (including user interruption)
#ifdef ENABLE_AUTO_RETRY
        // Update timestamp on successful stream completion
        _lastSuccessfulRequestTime = millis();
#endif
        _setStreamState(StreamState::IDLE);
    } else {
        // Actual error occurred
        _setStreamState(StreamState::ERROR);
    }
    
    return success;
}

// Enhanced stream processing with thread safety and metrics
bool ESP32_AI_Connect::_processStreamResponse(const String& url, const String& requestBody) {
    // Clean up any previous connections first
    _httpClient.end();
    _wifiClient.stop();
    delay(50); // Give time for cleanup
    
    // Start new connection
    if (!_httpClient.begin(_wifiClient, url)) {
        _lastError = "HTTP Client failed to begin connection to: " + url;
        return false;
    }

    _platformHandler->setHeaders(_httpClient, _apiKey); // Set headers via handler
    _httpClient.setTimeout(AI_API_HTTP_TIMEOUT_MS); // Use configured timeout
    
    int httpCode = _httpClient.POST(requestBody);
    
    // Store HTTP response code safely
    if (_acquireStreamLock(10)) {
        _streamResponseCode = httpCode;
        _releaseStreamLock();
    }

    if (httpCode <= 0) {
        _lastError = String("HTTP Request Failed: ") + _httpClient.errorToString(httpCode).c_str();
        _httpClient.end();
        _wifiClient.stop();
        return false;
    }

    if (httpCode != HTTP_CODE_OK) {
        String responsePayload = _httpClient.getString();
        _lastError = "HTTP Error: " + String(httpCode) + " - Response: " + responsePayload;
        _httpClient.end();
        _wifiClient.stop();
        return false;
    }

    #ifdef ENABLE_DEBUG_OUTPUT
    Serial.println("---------- AI Streaming Response ----------");
    Serial.println("HTTP Code: " + String(httpCode));
    Serial.println("Reading stream...");
    Serial.println("------------------------------------------");
    #endif

    // Set state to active now that we're connected
    _setStreamState(StreamState::ACTIVE);

    // Process streaming response with enhanced metrics
    Stream* stream = _httpClient.getStreamPtr();
    unsigned long lastChunkTime = millis();
    bool streamComplete = false;
    bool userInterrupted = false;
    uint32_t localChunkCount = 0;
    
    while (_httpClient.connected() && _getStreamState() == StreamState::ACTIVE && 
           !streamComplete && !userInterrupted) {
        
        if (stream->available()) {
            String chunk = stream->readStringUntil('\n');
            lastChunkTime = millis();
            localChunkCount++;
            
            // Thread-safe update of raw response and metrics
            if (_acquireStreamLock(10)) {
                _streamRawResponse = chunk;
                _streamTotalBytes += chunk.length();
                _streamChunkCount = localChunkCount;
                _releaseStreamLock();
            }
            
            // Process chunk with platform handler
            bool isComplete = false;
            String errorMsg = "";
            String content = _platformHandler->processStreamChunk(chunk, isComplete, errorMsg);
            
            if (!errorMsg.isEmpty()) {
                _lastError = errorMsg;
                break;
            }
            
            if (isComplete) {
                streamComplete = true;
            }
            
            // Create enhanced chunk info
            StreamChunkInfo chunkInfo;
            chunkInfo.content = content;
            chunkInfo.isComplete = isComplete;
            chunkInfo.chunkIndex = localChunkCount;
            chunkInfo.totalBytes = _streamTotalBytes;
            chunkInfo.elapsedMs = getStreamElapsedTime();
            chunkInfo.errorMsg = errorMsg;
            
            // Call user callback with enhanced info
            if (!content.isEmpty() || isComplete) {
                // Get callback safely
                StreamCallback callback = nullptr;
                if (_acquireStreamLock(10)) {
                    callback = _streamCallback;
                    _releaseStreamLock();
                }
                
                if (callback && !callback(chunkInfo)) {
                    userInterrupted = true;
                    break;
                }
            }
            
            #ifdef ENABLE_DEBUG_OUTPUT
            if (!content.isEmpty()) {
                Serial.print("Stream chunk: ");
                Serial.println(content);
            }
            #endif
        } else {
            // Check for timeout and state changes
            if (millis() - lastChunkTime > STREAM_CHAT_CHUNK_TIMEOUT_MS) {
                _lastError = "Stream timeout: No data received within " + String(STREAM_CHAT_CHUNK_TIMEOUT_MS) + "ms";
                break;
            }
            
            if (_getStreamState() == StreamState::STOPPING) {
                userInterrupted = true;
                break;
            }
            
            delay(10); // Yield to other tasks
        }
    }
    
    // Comprehensive cleanup
    _httpClient.end();
    _wifiClient.stop();
    delay(100); // Give extra time for connection cleanup
    
    // Handle different exit conditions
    if (userInterrupted) {
        // User interruption is not an error - it's a normal way to stop streaming
        // Don't set _lastError for user interruption
        return true; // Return true to indicate successful (user-controlled) completion
    }
    
    return streamComplete;
}

#endif // ENABLE_STREAM_CHAT